<div class="container">
	<div class="row my-header-row">
		<div class="col-md-12">
			<p class="my-h1">Projekte &amp; Kompetenzen</p>
			<p class="my-h2">Softwarel&ouml;sungen, die es auf den Punkt
				bringen.</p>
			<p class="my-h2">Leicht. Klar. Praktisch.</p>
		</div>
	</div>
	<div class="row article-row">
		<div class="col-md-8 description-column ">
			Meine St&auml;rke ist die Entwicklung komplexer Web-Applikationen. 
			<br>
			<br>Bei mir sind Sie richtig, wenn Sie keine Fertigl&ouml;sung f&uuml;r Ihr Pojekt finden.<br>
			<br>
			<div class="centered">
				<a class="link" href="#/contact">Kontaktieren
					Sie mich!</a>
			</div>
			<br> Ich werde Ihr Softwareprojekt gerne analysieren und Ihnen
			Optionen zur Durchf&uuml;hrung aufzeigen.<br>
		</div>
		<div class="col-md-4 facts-column"></div>
	</div>
	<div class="row article-row">
		<div class="col-md-8 description-column ">
			<h5>MonaStack - Ein Technologiestack</h5>
			MonaStack ist eine Sammlung von bew&auml;hrten und gut kombinierbaren Technologien. 
			Der sich daraus ergebende Stack erm&ouml;glicht eine schnelle, sichere und
			saubere Umsetzung komplexer Web-Entwicklungsprojekte.<br>
			<br>Mit MonaStack sind folgende Aspekte abgedeckt:<br>&nbsp;<br>
			<ul>
				<li>Continuous Integration und Testing</li>
				<li>Versioning, Roadmaps, Releases, SCM</li>
				<li>Authentication</li>
				<li>Authorization</li>
				<li>Scalability via Cloud-Deployment (optional)</li>
				<li>Clear Component Dependencies</li>
				<li>DTO-Entity-Mapping/Persistence</li>
				<li>Custom Datatypes on Client-Side</li>
				<!--li>Strong Typed Interfaces</li-->
				<li>Standard Code-Formatter</li>
				<li>Out-Of-The-Box Functions:</li>
				<ul>
					<li>CRUD (create, read, update, delete)</li>
					<li>MVC (all views get updated on change)</li>
					<li>Paging</li>
					<li>Querying</li>
					<li>Import/Export</li>
					<li>History-Controller</li>
					<li>File Upload/Download</li>
					<li>Default CSS-Styles</li>
				</ul>
			</ul>
			Das Erfolgsrezept von MonaStack ist die saubere Anwendung einiger
			weniger, sorgf&auml;ltig ausgew&auml;hlter Technologien. Durch sinnvolle
			Abstraktionen und klare Konventionen werden Best-Practices gef&ouml;rdert.<br>
			<br>Fortlaufend findet eine Anpassung des MonaStacks an die
			Entwicklungen der IT statt.  <br>
			<br>Aus unserer Sicht ist eine gut gepflegte Standardarchitektur
			mit Referenzimplementierung die Grundvoraussetzung f&uuml;r eine
			erfolgreiche, effiziente und skalierbare Softwareentwicklung.<br>
			<br>Bei Interesse stelle ich MonaStack sehr gerne vor.  Gerne stehe ich Ihnen auch zur Seite, einen
			f&uuml;r Sie passenden Stack auszuarbeiten.<br>
		</div>
		<div class="col-md-4 facts-column">
			<ul>
				<li>MonaStack-Projekte:</li>
				<ul>
					<li>TeamTable</li>
					<li>Cutworks</li>
					<li>HotelOrga</li>
					<li>SupeYou</li>
				</ul>
			</ul>
		</div>
	</div>
	<div class="row article-row">
		<div class="col-md-8 description-column ">
			<div><h5><a href="#/teamtable">TeamTable</a> - Das Produkt</h5>TeamTable erm&ouml;glicht die Bearbeitung gro&szlig;er Datenmengen im Team.<br>Es wurde als Produkt f&uuml;r den kommerziellen Vertrieb entwickelt. <br>Besondere Herausforderungen waren performante Handhabung sehr gro&szlig;er Datenmengen auf generischem Datenmodell, Excel-Integration, produktf&auml;higes Ship- u. Deployment, einfache Benutzung und stimmiges Funktionsdesign.<br><br>Detailierte Informationen finden Sie unter dem Men&uuml;-Punkt 'TeamTable'.</div>
		</div>
		<div class="col-md-4 facts-column">
			<ul>        <li>Technologien u.a.:</li>        <ul>            <li>SmartGWT</li>            <li>JPA/Hibernate</li>            <li>Oracle, MySQL, Derby</li>            <li>Excel mit POI</li>            <li>OpenID, LDAP</li>            <li>JProfiler, JMeter</li>        </ul>    </ul>
		</div>
	</div>
	<div class="row article-row">
		<div class="col-md-8 description-column ">
			<div><h5><a href="http://docsafe.ch">Docsafe</a> - Beratungs- und Entwicklungsprojekt bei der Swisscom</h5>In diesem millionenschweren Projekt hat die Swisscom eine Dropbox-Alternative mit echtem Mehrwert geschaffen. Ein label-basiertes Rechtesystem und die Einbindung von Dokumenten-Sendern macht den Docsafe zur Post-Alternative f&uuml;r millionen Kunden.<br><br><br><br></div>
		</div>
		<div class="col-md-4 facts-column">
			<ul>        <li>Swisscom ITS</li>        <li>Beratung &amp; Entwicklung</li>        <li>Teamgr&ouml;&szlig;e: 12-20</li>        <li>Offshore Schulung (Polaris)</li>        <li>HighPerformance/LargeScale</li>        <li>Technologien u.a.:</li>        <ul>            <li>SCRUM</li>            <li>Analytics</li>            <li>CSS3/HTML5</li>            <li>Flyway</li>            <li>Oracle</li>        </ul>    </ul>
		</div>
	</div>
	<div class="row article-row">
		<div class="col-md-8 description-column ">
			<div><h5><a href="https://www.cutworks.com/shop/">Cutworks</a> - Ein Bestellsystem f&uuml;r lasergeschnittene Metallteile</h5>Cutworks ist ein Shoppingsystem mit ganz besonderen Anforderungen:  <ul>		<li>Konsistenzpr&uuml;fung und Nachbearbeitung von CFX-Dateien im Browser</li>		<li>Staffelpreise in Abh&auml;ngigkeit von Material, Dicke, Schnittform</li>		<li>Differenzierung von Firmen und Nutzern</li>		<li>Teile-Management mit Labeling-System</li>		<li>Internationales Shipping und sprachliche Internationalisierung</li>		<li>Lieferzeitberechnung, Ber&uuml;cksichtigung von Rabattcodes, Brutto/Netto ...</li> </ul> Ich habe eine den Anforderungen gerecht werdende Architektur inklusive moderner CI-Entwicklungsumgebung geliefert. Mit dem fantastischen Team und komponentenorientierter Entwicklung (CFX-Editor, Teile-Management, Shop) konnte schnell zu einem sehr produktiven Arbeitsmodus gefunden werden.</div>
		</div>
		<div class="col-md-4 facts-column">
			<ul>        <li>Cutworks GmbH</li>        <li>Rolle: Architekt</li>        <li>Teamgr&ouml;&szlig;e: 3</li>        <li>Technologien u.a.:</li>        <ul>            <li>CFX</li>            <li>Lasercut</li>            <li>MONA</li>            <li>Jenkins/Maven/SVN</li>        </ul>    </ul>
		</div>
	</div>
	<div class="row article-row">
		<div class="col-md-8 description-column ">
			<div><h5><a href="http://hotelorga.com">HotelOrga</a> - Hotelabrechnungen mit Sonderanforderungen</h5>Durch die besondere Aufstellung bei der Abrechnung von G&auml;sten mit unterschiedlichen Kostentr&auml;gern konnte in diesem Fall keine Fertigl&ouml;sung zur Abrechnung eingesetzt werden. <br>Mit der von mir entwickelten L&ouml;sung k&ouml;nnen Abrechnungen nun auf Knopfdruck als Word und Excel erzeugt werden. <br>Mit der Software werden monatlich 4 Arbeitstage und hunderte Seiten Papier eingespart. Nebenbei ergeben sich tolle Auswertungsm&ouml;glichkeiten, Nachverfolgbarkeit und eine drastische Qualit&auml;tsverbesserung.  Das Personal hat durch Tablets schnell und ortsungebunden Zugriff auf die im allt&auml;glichen Hotelbetrieb notwendigen Informationen (Zimmerbelegungen, Auszugsdatum, Kinder, etc.). Alle Daten k&ouml;nnen &uuml;ber Rollen feingranularen zugriffsgesch&uuml;tzt werden.<br>Eine direkte Anbindung einer Abrechnungsschnittstelle mit den Kostentr&auml;gern ist in Vorbereitung.<br></div>
		</div>
		<div class="col-md-4 facts-column">
			<ul>        <li>HotelWaltram GmbH</li>        <li>Technologien u.a.:</li>        <ul>            <li>Anroid Studio</li>            <li>Anroid WebView</li>            <li>GAE</li>            <li>DataStore</li>            <li>CI/Maven/Jenkins</li>        </ul>    </ul>
		</div>
	</div>
	<div class="row article-row">
		<div class="col-md-8 description-column ">
			<div><h5><a href="http://supeyou.com">SupeYou</a> - Ein bisschen Weltverbesserung</h5>Bei SupeYou handelt es sich um ein Sideprojekt ohne Gesch&auml;ftsmodell. Die Idee ist es Einzelne in ihrer gemeinn&uuml;tzigen Arbeit aus der Crowd zu finanzieren. Der Clou sind "Observable Invitations" mit deren Hilfe Unterst&uuml;tzer ihre "Einladungswelle", als Grafik visualisiert verfolgen k&ouml;nnen.<br></div>
		</div>
		<div class="col-md-4 facts-column">
<ul>        <li>Sideprojekt</li>        <li>Mobile Web-App</li>        <li>Technologien u.a.:</li>        <ul>            <li>Responsive HTML</li>            <li>Paypal API</li>            <li>SVG</li>        </ul>    </ul>
		</div>
	</div>
	<!--div class="row article-row">
		<div class="col-md-8 description-column ">
		<div><h5>MTheile.com - Webauftritt in eigener Sache</h5>Der Webauftritt MTheile.com basiert auf GWT. Das zeigt die gro&szlig;e Einsatzbreite dieser Technologie. Von relativ statischen Webinhalten bis komplexen Internet-Anwendungen (z.B. Google Wave, Angry Birds Chrome, TeamTable) ist GWT zuhause. Wir sind der &Uuml;berzeugung, dass auch Sie mit GWT auf das richtige Pferd setzen.<br>GWT ist gewisserma&szlig;en die K&ouml;nigsklasse der Webprogrammierung. Objektorientierte Methoden k&ouml;nnen ohne Technologiebruch client- und serverseitig angewendet werden. Durch die abstrakte Beschreibung der Clientfunktionalit&auml;t in Java kann, mit dem st&auml;ndig weiterentwickelten Compiler, jederzeit auf neue Eigenschaften der Browser reagiert werden. Cross-Browser-Kompatibilit&auml;t ist eine Selbstverst&auml;ndlichkeit. F&uuml;r die Entwicklung der zukunftstr&auml;chtigen, mobilen HTML5-L&ouml;sungen ist GWT ebenfalls hervorragend geeignet.<br></div>
		</div>
		<div class="col-md-4 facts-column">
		<ul>        <li>Technologien u.a.:</li>        <ul>            <li>GWT-History</li>            <li>GWT-Designer, Photoshop</li>            <li>CSS</li>            <li>AJAX </li>            <li>Google Analytics</li>            <li>Auth0-Auth-Service</li>        </ul>    </ul>
		</div>
	</div-->
	<div class="row article-row">
		<div class="col-md-8 description-column ">
		<div><h5>DynSBatch - &Uuml;berlegenheit durch Reflection</h5>DynSBatch ist ein Produkt und erm&ouml;glicht schnelle und flexible Datenpflege auf dem Kernbanksystem OSPlus der Sparkassen durch Massenauftr&auml;ge. &Uuml;ber eine komfortable, GWT-basierte Benutzungsoberfl&auml;che im Browser k&ouml;nnen Auftr&auml;ge eingestellt, &uuml;berwacht und ausgewertet werden.<br>Die besondere Herausforderung bestand in der generischen Anbindung der mehr als 1000 fachlichen WebServices der dynamischen SOAP-Schnittstelle (DynS). Dies wurde durch eine Kombination der Java-Reflection-API und Axis erreicht.<br>Eine weitere Besonderheit ist eine modulare Funktionserweiterung mit fachlichen Bausteinen. Durch die Nutzung des RCP/OSGi-Frameworks k&ouml;nnen sogenannte Bundles vom Kunden extra gekauft und dem System per Mausklick hinzugef&uuml;gt werden.<br>Das Datenmodell wurde mit MagicDraw definiert und schlie&szlig;lich generiert. In diesem MDA-Ansatz (Model Driven Architekture) kam AndroMDA zum Einsatz.<br>Die Anwendung ist bei mehr als 30 Sparkassen sehr erfolgreich im Einsatz.</div>
		</div>
		<div class="col-md-4 facts-column">
		<ul>        <li>Vertrag: Anstellung </li>        <li>Rolle: Projektleitung </li>        <li>Teamgr&ouml;&szlig;e: 3  </li>        <li>Technologien u.a.:</li>        <ul>            <li>OO-Modellierung / UML</li>            <li>MagicDraw, AndroMDA</li>            <li>Reflection API</li>            <li>Axis / WebService / SOAP</li>            <li>RCP / OSGi</li>            <li>Jetty</li>        </ul>    </ul>
		</div>
	</div>
	<div class="row article-row">
		<div class="col-md-8 description-column ">
		<div><h5>BeteiligungsIntegrator - Zuverl&auml;ssig trotz schwieriger Umgebung</h5>Der BeteiligungsIntegrator l&auml;uft als 24/7 Hintergrundjob. Durch ihn werden Daten geschlossener Fonds im Kernbanksystem von Sparkassen aktuell gehalten. Daten mehrerer Anbieter werden &uuml;ber propriet&auml;re Schnittstellen (secured SOAP, JSON) geholt, semantisch vereinheitlicht und in das OSPlus-System &uuml;bertragen.<br>Des Weiteren existiert eine Benutzungsoberfl&auml;che zur OSPlus-Administration. Mit ihrer Hilfe kann eine Bank sehr komfortable entsprechende Vertragsarten einrichten.<br>Herausforderung war die Zuverl&auml;ssigkeit trotz Anbindung an sehr unterschiedliche Schnittstellen mit einer Vielzahl schwer vorhersehbaren Ereignissen und die Datenabstraktion als Grundlage zur Daten&uuml;bersetzung.<br>Der Prozess l&auml;uft zuverl&auml;ssig bei mehreren Banken.</div>
		</div>
		<div class="col-md-4 facts-column">
		<ul>        <li>Vertrag: Anstellung </li>        <li>Rolle: Projektleitung </li>        <li>Teamgr&ouml;&szlig;e: 4  </li>        <li>Technologien u.a.:</li>        <ul>            <li>SOAP/JSON</li>            <li>SSH</li>            <li>DynS/StatS (OSPlus)</li>        </ul>    </ul>
		</div>
	</div>
	<div class="row article-row">
		<div class="col-md-8 description-column ">
		<div><h5>DWH4OSPlus - Trenderkennung durch regelm&auml;&szlig;ige Datenanalyse</h5>DWH4OSPlus ist ein Framework f&uuml;r die Datenauswertung einer Sparkasse. Gesch&auml;ftsdaten werden in konfigurierbaren Zeitintervallen analysiert und als Kennzahlen aufbereitet. Die Ergebnisse werden in einer Access-DB festgehalten. Durch RCP-Extension-Points (wie bei DynSBatch) k&ouml;nnen dem System neue Kennzahl-Module hinzugef&uuml;gt werden. Sparkassenmitarbeiter k&ouml;nnen durch Modifikation der Access-DB die Kennzahlen-Darstellungen, z.B. als Charts beliebig anpassen.<br>Die Herausforderung bestand darin, eine laufende Kennzahlengenerierung mit flexiblen Auswertungs- und Darstellungsm&ouml;glichkeiten zu bieten. Dies ist durch den programmatischen Zugriff auf Access-MDB-Dateien gelungen. Die gesamte Steuerung findet &uuml;ber den Browser mit einer GWT-Oberfl&auml;che statt.</div>
		</div>
		<div class="col-md-4 facts-column">
		<ul>        <li>Vertrag: Anstellung</li>        <li>Technologien u.a.:</li>        <ul>            <li>Access</li>            <li>ODBC </li>            <li>JDBC</li>            <li>SQL (Access, DB2)</li>        </ul>    </ul>
		</div>
	</div>
	<div class="row article-row">
		<div class="col-md-8 description-column ">
		<div><h5>KundenZuordner - Der TeamTable-Vorl&auml;ufer</h5>Den KundenZuordner k&ouml;nnte man als ein auf Kundenzuordnung spezialisiertes TeamTable bezeichnen. Durch die gemeinsame und koordinierte Bearbeitung einer Liste k&ouml;nnen sich Berater ihre Kunden untereinander zuordnen.<br>Die Herausforderung war, diese akut ben&ouml;tigte Software sehr schnell fertig zu stellen. Dies ist durch den Einsatz von ExtGWT-Widgets in weniger als zwei Wochen gelungen. Trotz dieses Schnellschusses wurde die Software &uuml;ber Jahre in mehreren Projekten eingesetzt.</div>
		</div>
		<div class="col-md-4 facts-column">
		<ul>        <li>Vertrag: Anstellung</li>        <li>Technologien u.a.:</li>        <ul>            <li>ExtGWT</li>            <li>Async. Progr.</li>            <li>Thread Safety/Semaphore</li>            <li>ANT</li>        </ul>    </ul>
		</div>
	</div>
	<div class="row article-row">
		<div class="col-md-8 description-column ">
		<div><h5>Autograph - Eine Shibboleth Erweiterung</h5>Autograph ist eine Shibboleth-Erweiterung. Sie dient bei einer Shibboleth-Authentifizierung dem Nutzer zur Wahrung seiner Privatsph&auml;re. Der Nutzer kann &uuml;ber Attribut Release Policies (ARPs) die Weitergabe seiner pers&ouml;nlichen Daten von Identity-Providern (IDPs) zu Service-Providern (SPs) steuern.<br>Die Herausforderung bestand in der nahtlosen Integration von Autograph in Shibboleth. Dies geschah in Zusammenarbeit mit Internet2, der Organisation hinter Shibboleth. Das Ergebnis wurde auf einer Internet2-Konferenz in Washington D.C. von mir als Vertreter der Macquarie University vorgestellt.</div>
		</div>
		<div class="col-md-4 facts-column">
		<ul>        <li>Macquarie University of Sydney</li>        <li>Sprache: English</li>        <li>Rolle: Architekt </li>        <li>Technologien u.a.:</li>        <ul>            <li>Shibboleth</li>            <li>XACML</li>            <li>SAML</li>        </ul>    </ul>
		</div>
	</div>
	<div class="row article-row">
		<div class="col-md-8 description-column ">
		<div><h5>SparkassenMigrator - Die Migrationshilfe</h5>Der SparkassenMigrator diente der Aufbereitung von Personendaten zur Migration aus dem Bestandssystem der bayrischen Sparkassen in das neu einzuf&uuml;hrende Kernbanksystem OSPlus der Finanz Informatik. Dazu mussten zun&auml;chst die in Form gro&szlig;er CSV-Dateien vorliegenden Personendaten anhand eines komplexen Datenmodells in eine Datenbank importiert werden. Anschlie&szlig;end wurden die Daten &uuml;ber eine GWT-Oberfl&auml;che im Browser visualisiert und von den Bearbeitern editiert. Die aufbereiteten Daten wurden dann &uuml;ber ein Drittsystem in das Bestandssystem zur&uuml;ckgeschrieben.<br>Die Hauptanforderungen lagen einerseits in der Bew&auml;ltigung der komplexen Fachlichkeit, andererseits in der Optimierung des Systems f&uuml;r gro&szlig;e Datenmengen und den Mehrbenutzerbetrieb. Dies gelang in weniger als 2,5 Monaten Entwicklungszeit.<br>Das System kam sehr erfolgreich bei &uuml;ber zwanzig Sparkassen zum Einsatz.</div>
		</div>
		<div class="col-md-4 facts-column">
		<ul>        <li>Vertrag: Anstellung</li>        <li>Rolle: Projektleitung</li>        <li>Teamgr&ouml;&szlig;e: 4</li>        <li>Technologien u.a.:</li>        <ul>            <li>OO-Modellierung, UML</li>            <li>MagicDraw, AndroMDA</li>            <li>Maven</li>            <li>FI-Listen</li>        </ul>    </ul>
		</div>
	</div> 
	<div class="row article-row">
		<div class="col-md-8 description-column ">
		<div><h5>WAC-Manager - Verwaltungssoftware f&uuml;r den Wolfratshauser Aktienclub</h5>Monatlich zahlen die Mitglieder des Clubs fast beliebige Betr&auml;ge in das Konto des WAC ein. Von diesem Kapital wurden dann, durch den Anlageausschuss festgelegte Aktien gekauft. Anfangs war die Aufgabe der Software "nur" die Anteile der Clubmitglieder aus ihren Guthaben und den Depotentwicklungen zu berechnen. Im Laufe der Zeit hat sich der WAC-Manager zu einem Mitgliederportal mit individuellen Chartdarstellungen, Adressverwaltung, etc. entwickelt. Die WAC-Verwaltung konnte Jahresberichte f&uuml;r alle Mitglieder und den Steuerbericht auf Knopfdruck generieren.<br>Mit dem WAC-Manager wurden &uuml;ber fast 10 Jahre mehrere hunderttausend Euro verwaltet. <br>2011 wurde der Club aus Zweifel an B&ouml;rsenspekulationen aufgel&ouml;st.</div>
		</div>
		<div class="col-md-4 facts-column">
		<ul>        <li>Vertragsart: Auftrag</li>        <li>Technologien u.a.:</li>        <ul>            <li>JFreeChart </li>            <li>JSP (Java Server Pages)</li>            <li>Struts</li>            <li>XPath/XSD</li>            <li>Xerces</li>        </ul>    </ul>
		</div>
	</div>
	<div class="row article-row">
		<div class="col-md-8 description-column ">
		<div><h5>Weitere Projekterfahrung und Beratung</h5>Ich habe in meiner Laufbahn viele weitere Entwicklungsprojekte durchgef&uuml;hrt und dabei zahlreiche, noch nicht genannte Bibliotheken, Frameworks, Standards und Applikationen eingesetzt. Beispielsweise: Eclipse, NetBeans, Together, XML Spy, JUnit, CVS, SVN, XSLT, XQuery, XPointer, XLink, DTD, XML-Schema, Schematron, Regel Engines: JESS u. Drools, XML database (Berkeley, eXist), CORBA, JFlex/CUP, WebService based repository (Fedora), etc.<br><br>Ich stehe Ihnen f&uuml;r Ihr IT-Projekt auch als Berater zur Verf&uuml;gung.</div>
		</div>
		<div class="col-md-4 facts-column">
		
		</div>
	</div>
</div>